[
  {
    "id": "F3EC43",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о численности населения городов разных стран. Ниже приведены первые пять строк таблицы.          A   B   C     1   Город   Численность населения   Страна     2   Асмун   91,40   Египет     3   Винер-Нойштадт   39,94   Австрия     4   Люлебургаз   100,79   Турция     5   Фёклабрук   11,95   Австрия      В столбце A указано название города; в столбце B – численность населения (тыс. человек); в столбце C – название страны.  Всего в электронную таблицу были занесены данные по 1000 городов. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько городов Республики Беларусь представлено в таблице? Ответ запишите в ячейку F2. 2.     Какова средняя численность населения городов, в которых количество жителей не превышает 100 тыс. человек? Ответ на этот вопрос с точностью не менее двух знаков после запятой (в тыс. человек) запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества городов Республики Беларусь, Египта и Турции, представленных в таблице. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 1
  },
  {
    "id": "7E9007",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки; в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какова суммарная масса грузов перевезённых с 3 по 5 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых из города Орехово? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок из городов Дубки, Липки, Орехово. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 3
  },
  {
    "id": "7EE50E",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   округ   код ученика   любимый предмет   балл     2   С   Ученик 1   обществознание   246     3   В   Ученик 2   немецкий язык   530     4   Ю   Ученик 3   русский язык   576     5   СВ   Ученик 4   обществознание   304      В столбце A записан округ, в котором учится ученик; в столбце B – код ученика; в столбце C – любимый предмет; в столбце D – тестовый балл. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько учеников в Центральном округе (Ц) выбрали в качестве любимого предмета английский язык? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каков средний тестовый балл у учеников Восточного округа (В)? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из округов с кодами «З», «ЮЗ» и «Ц». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 3
  },
  {
    "id": "B1D103",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          А   В   С   D   Е     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность, Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жареный   52,0   26,0   13,4   626     4   Горох отварной   0,8   10,5   20,4   130     5   Горошек зелёный   0,2   5,0   8,3   55      В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце Е – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.      Сколько продуктов в таблице содержат меньше 25 г жиров и меньше 25 г белков? Запишите количество этих продуктов в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием углеводов более 50 г? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение суммарного количества жиров, белков и углеводов во второй сотне продуктов (номера 102–201). Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 3
  },
  {
    "id": "EA3603",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки; в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какой суммарный расход бензина был при осуществлении перевозок  с 1 по 3 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых в город Березки? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок 4 октября, 5 октября и 6 октября. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 4
  },
  {
    "id": "3F5704",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные олимпиады по математике. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   номер участника   номер школы   класс   баллы     2   участник 1   38   8   55     3   участник 2   32   9   329     4   участник 3   30   8   252     5   участник 4   50   8   202      В столбце A записан номер участника; в столбце B – номер школы;  в столбце C – класс; в столбце D – набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько девятиклассников набрали более 250 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл, полученный учениками школы № 3? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из школ № 49, 46 и 48. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 4
  },
  {
    "id": "7B7C78",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о товарах, хранящихся на складах  в разных округах. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   Округ   Товары   Номер склада   Стоимость (руб.)     2   С   Товар 1   8   5634     3   В   Товар 2   1   27223     4   Ю   Товар 3   3   3004     5   СВ   Товар 4   3   28971      В столбце A записан код округа, в котором находится склад с товарами;  в столбце B – товары; в столбце C – номер склада; в столбце D – стоимость товара в рублях. Всего в электронную таблицу были занесены данные по 1000 товаров. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.        Сколько товаров находится на складе с номером 5, у которых стоимость менее 1000 рублей? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.        Какова средняя стоимость товаров в южном (Ю) округе? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.        Постройте круговую диаграмму, отображающую соотношение количества товаров в Южном (Ю), Северном (С) и Восточном (В) округах. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 4
  },
  {
    "id": "B1A170",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какое среднее количество осадков выпадало за сутки в весенние месяцы (март, апрель, май)? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какая средняя скорость ветра была в те дни года, когда дул юго-западный (ЮЗ) ветер? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда давление было 750, 751 и 752 мм рт. ст. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 4
  },
  {
    "id": "1BEAB1",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные олимпиады по математике. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   номер участника   номер школы   класс   баллы     2   участник 1   38   8   55     3   участник 2   32   9   329     4   участник 3   30   8   252     5   участник 4   50   8   202      В столбце A записан номер участника; в столбце B – номер школы;  в столбце C – класс; в столбце D – набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько семиклассников набрали менее 200 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл, полученный учениками школы № 20? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из школ № 1, 6 и 7. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 5
  },
  {
    "id": "C1D9B4",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   округ   код ученика   любимый предмет   балл     2   С   Ученик 1   обществознание   246     3   В   Ученик 2   немецкий язык   530     4   Ю   Ученик 3   русский язык   576     5   СВ   Ученик 4   обществознание   304      В столбце A записан округ, в котором учится ученик; в столбце B – код ученика; в столбце C – любимый предмет; в столбце D – тестовый балл. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько учеников в Северо-Западном округе (СЗ) выбрали в качестве любимого предмета русский язык? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каков средний тестовый балл у учеников Западного округа (З)? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из округов с кодами «Ю», «ЮВ» и «ЮЗ». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 5
  },
  {
    "id": "9E1EBA",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о товарах, хранящихся на складах  в разных округах. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   Округ   Товары   Номер склада   Стоимость (руб.)     2   С   Товар 1   8   5634     3   В   Товар 2   1   27223     4   Ю   Товар 3   3   3004     5   СВ   Товар 4   3   28971    В столбце A записан код округа, в котором находится склад с товарами;  в столбце B – товары; в столбце C – номер склада; в столбце D – стоимость товара в рублях. Всего в электронную таблицу были занесены данные по 1000 товаров. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.        Сколько товаров находится на складе 8 в Северном округе (С)? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.        Какова средняя стоимость товаров во всех округах, которые находятся на складах с номером 3? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.        Постройте круговую диаграмму, отображающую соотношение количества товаров на складах под номерами 3, 5, 7 и 8 во всех округах. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 6
  },
  {
    "id": "7B6613",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки;  в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     На какое суммарное расстояние были произведены перевозки с 1 по  3 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых из города Липки? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок из городов Березки, Буково, Вязово. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 6
  },
  {
    "id": "6AD217",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о результатах тестирования. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   номер участника   баллы русский язык   баллы математика   баллы физика   баллы информатика     2   участник 1   79   81   44   85     3   участник 2   98   23   82   89     4   участник 3   48   79   88   90     5   участник 4   94   35   90   40      В столбце A записан номер участника; в столбце B – балл по русскому языку; в столбце C – балл по математике; в столбце D – балл по физике;  в столбце E – балл по информатике. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников тестирования получили по русскому языку, информатике, и математике в сумме более 200 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл по математике у участников, которые набрали по физике более 60 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, набравших 45 баллов по русскому языку, математике, физике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 7
  },
  {
    "id": "118821",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты тестирования учащихся по математике и физике. На рисунке приведены первые строки получившейся таблицы.        A   B   C   D     1   Ученик   Район   Математика   Физика     2   Шамшин Владислав   Майский   65   79     3   Гришин Борис   Заречный   52   30     4   Огородников Николай   Подгорный   60   27     5   Богданов Виктор   Центральный   98   86      В столбце A указаны фамилия и имя учащегося; в столбце B – район города, в котором расположена школа учащегося; в столбцах C, D – баллы, полученные соответственно по математике и физике. По каждому предмету можно было набрать от 0 до 100 баллов. Всего в электронную таблицу были занесены данные по 1000 учащихся. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Чему равна наибольшая сумма баллов по двум предметам среди учащихся Майского района? Ответ на этот вопрос запишите в ячейку G1 таблицы. 2.     Сколько процентов от общего числа участников составили ученики Майского района? Ответ с точностью до одного знака после запятой запишите в ячейку G2 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из Майского, Кировского и Центрального районов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.  Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 7
  },
  {
    "id": "161D29",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какой была средняя температура воздуха в летние месяцы (июнь, июль, август)? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какое среднее количество осадков выпадало за сутки в те дни года, когда дул северо-восточный (СВ) ветер? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда дули ветры «З», «ЮЗ» и «СЗ». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 7
  },
  {
    "id": "3A9E25",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          А   В   С   D   Е     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность, Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жареный   52,0   26,0   13,4   626     4   Горох отварной   0,8   10,5   20,4   130     5   Горошек зелёный   0,2   5,0   8,3   55      В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце Е – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.      Сколько продуктов в таблице содержат меньше 50 г углеводов  и меньше 50 г белков? Запишите количество этих продуктов в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием жиров менее 1 г? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение среднего количества жиров, белков и углеводов в третьей сотне продуктов (номера 202–301). Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 8
  },
  {
    "id": "CB32DC",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          А   В   С   D   Е     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность, Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жареный   52,0   26,0   13,4   626     4   Горох отварной   0,8   10,5   20,4   130     5   Горошек зелёный   0,2   5,0   8,3   55      В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце Е – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько продуктов в таблице содержат меньше 10 г жиров  и меньше 10 г углеводов? Запишите количество этих продуктов  в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием белков менее 1 г? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение суммарного количества жиров, белков и углеводов в продуктах. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 8
  },
  {
    "id": "49EE5F",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.            A   B   C   D   E     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность,  Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жар.   52   26   13,4   626     4   Горох отв.   0,8   10,5   20,4   130     5   Горошек зел.   0,2   5   8,3   55    В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце E – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     У какого количества продуктов с содержанием менее 1 г жиров количество белков превышает 10 г? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Какова общая калорийность продуктов с содержанием более 40 г жиров и менее 10 г углеводов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества продуктов с содержанием углеводов менее 5 г, от 5 г до 20 г включительно и более 20 г. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 9
  },
  {
    "id": "E9CB5A",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки; в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какова суммарная масса грузов, перевезённых с 6 по 8 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых в город Буково? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок в города Орехово, Осинки и Сосново. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 9
  },
  {
    "id": "5141A1",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные олимпиады по математике. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   номер участника   номер школы   класс   баллы     2   участник 1   38   8   55     3   участник 2   32   9   329     4   участник 3   30   8   252     5   участник 4   50   8   202      В столбце A записан номер участника; в столбце B – номер школы;  в столбце C – класс; в столбце D – набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько десятиклассников набрали более 200 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл, полученный учениками школы № 14? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из школ № 48, 16 и 3. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 10
  },
  {
    "id": "855BAA",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников по трём предметам. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   Код ученика   Район   Русский язык   Математика   Информатика     2   Ученик 1   Майский   27   36   48     3   Ученик 2   Заречный   30   51   15     4   Ученик 3   Подгорный   54   97   98     5   Ученик 4   Центральный   66   96   32    В столбце A записаны коды учеников; в столбце B – район проживания;  в столбцах C, D и E – тестовые баллы по русскому языку, математике  и информатике соответственно. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько учеников из района Майский набрали по русскому языку более 70 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     У какого числа учащихся средний балл по всем трём предметам больше 80? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа учеников, набравших более 80 баллов по русскому языку, математике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 10
  },
  {
    "id": "E346C2",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.        A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какое среднее количество осадков выпадало за сутки в летние месяцы (июнь, июль, август)? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каким было среднее атмосферное давление в те дни года, когда дул юго-восточный (ЮВ) ветер? Ответ на этот вопрос запишите  в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда дули ветры «Ю», «ЮЗ» и «ЮВ». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 11
  },
  {
    "id": "8F12C4",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки;  в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах); в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какой суммарный расход бензина был при осуществлении перевозок  с 5 по 7 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых из города Сосново? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок из городов Орехово, Осинки и Сосново. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 11
  },
  {
    "id": "7CD192",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные олимпиады по математике Ниже приведены первые пять строк таблицы.          A   B   C   D     1   номер участника   номер школы   класс   баллы     2   участник 1   38   8   55     3   участник 2   32   9   329     4   участник 3   30   8   252     5   участник 4   50   8   202      В столбце A записан номер участника; в столбце B – номер школы;  в столбце C – класс; в столбце D – набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько восьмиклассников набрали более 210 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл, полученный учениками школы № 2? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой.  3.     Постройте круговую диаграмму, отображающую соотношение числа участников из 7, 8 и 9 классов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 11
  },
  {
    "id": "F9FEE1",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З».  В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Каким было среднее значение атмосферного давления в летние месяцы (июнь, июль, август)? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какая средняя температура была в те дни года, когда дул южный (Ю) ветер? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда давление было 762, 763 и 764 мм рт. ст. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 12
  },
  {
    "id": "C849E2",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Каким было среднее значение температуры в осенние месяцы (сентябрь, октябрь, ноябрь)? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каким было среднее атмосферное давление в те дни года, когда дул западный (З) ветер? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда давление было 757, 756 и 755 мм рт. ст. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 13
  },
  {
    "id": "1E466C",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   округ   код ученика   любимый предмет   балл     2   С   Ученик 1   обществознание   246     3   В   Ученик 2   немецкий язык   530     4   Ю   Ученик 3   русский язык   576     5   СВ   Ученик 4   обществознание   304      В столбце A записан округ, в котором учится ученик; в столбце B – код ученика; в столбце C – любимый предмет; в столбце D – тестовый балл. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько учеников в Северо-Восточном округе (СВ) выбрали в качестве любимого предмета математику? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каков средний тестовый балл у учеников Южного округа (Ю)? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, выбравших физкультуру, литературу и обществознание. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 13
  },
  {
    "id": "E20F66",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о результатах тестирования. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   номер участника   баллы русский язык   баллы математика   баллы физика   баллы информатика     2   участник 1   79   81   44   85     3   участник 2   98   23   82   89     4   участник 3   48   79   88   90     5   участник 4   94   35   90   40      В столбце A записан номер участника; в столбце B   –   балл по русскому языку; в столбце C   –   балл по математике; в столбце D   –   балл по физике;  в столбце E   –   балл по информатике. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников тестирования получили по информатике, физике  и математике в сумме более 200 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл по физике у участников, которые набрали по информатике более 60 баллов? Ответ на этот вопрос запишите  в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, набравших 80 баллов по русскому языку, математике, физике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 14
  },
  {
    "id": "8CDD64",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о результатах тестирования. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   номер участника   баллы русский язык   баллы математика   баллы физика   баллы информатика     2   участник 1   79   81   44   85     3   участник 2   98   23   82   89     4   участник 3   48   79   88   90     5   участник 4   94   35   90   40      В столбце A записан номер участника; в столбце B – балл по русскому языку; в столбце C – балл по математике; в столбце D – балл по физике;  в столбце E – балл по информатике. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников тестирования получили по русскому языку, физике и математике в сумме более 200 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл по физике у участников, которые набрали по математике более 60 баллов? Ответ на этот вопрос запишите  в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, набравших 90 баллов по русскому языку, математике, физике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 14
  },
  {
    "id": "1AA133",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   округ   код ученика   любимый предмет   балл     2   С   Ученик 1   обществознание   246     3   В   Ученик 2   немецкий язык   530     4   Ю   Ученик 3   русский язык   576     5   СВ   Ученик 4   обществознание   304      В столбце A записан округ, в котором учится ученик; в столбце B – код ученика; в столбце C – любимый предмет; в столбце D – тестовый балл. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько учеников в Восточном округе (В) выбрали в качестве любимого предмета информатику? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каков средний тестовый балл у учеников Северного округа (С)? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из округов с кодами «С», «СВ» и «СЗ». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 14
  },
  {
    "id": "2E0832",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о результатах тестирования. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   номер участника   баллы русский язык   баллы математика   баллы физика   баллы информатика     2   участник 1   79   81   44   85     3   участник 2   98   23   82   89     4   участник 3   48   79   88   90     5   участник 4   94   35   90   40      В столбце A записан номер участника; в столбце B – балл по русскому языку; в столбце C – балл по математике; в столбце D – балл по физике;  в столбце E – балл по информатике. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников тестирования получили по физике и математике  в сумме более 140 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл по математике у участников, которые набрали по русскому языку более 70 баллов? Ответ на этот вопрос запишите  в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, набравших 100 баллов по русскому языку, математике, физике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 14
  },
  {
    "id": "ABFC3C",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки;  в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какой суммарный расход бензина был при осуществлении перевозок  со 2 по 4 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых в город Дубки? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок в города Березки, Буково, Вязово. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 14
  },
  {
    "id": "C31333",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о численности населения городов разных стран. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Город   Численность населения   Страна     2   Асмун   91,40   Египет     3   Винер-Нойштадт   39,94   Австрия     4   Люлебургаз   100,79   Турция     5   Фёклабрук   11,95   Австрия    В столбце A указано название города; в столбце B – численность населения (тыс. человек); в столбце C – название страны.  Всего в электронную таблицу были занесены данные по 1000 городов. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какова суммарная численность населения в приведённых в таблице городах России? Ответ на этот вопрос с точностью до одного знака после запятой (в тыс. человек) запишите в ячейку F2. 2.     Сколько городов среди представленных в таблице имеют население не менее миллиона человек? Ответ на этот вопрос запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества городов Испании, Италии и Франции, представленных  в таблице. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 15
  },
  {
    "id": "FA3F89",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   округ   код ученика   любимый предмет   балл     2   С   Ученик 1   обществознание   246     3   В   Ученик 2   немецкий язык   530     4   Ю   Ученик 3   русский язык   576     5   СВ   Ученик 4   обществознание   304      В столбце A записан округ, в котором учится ученик; в столбце B – код ученика; в столбце C – любимый предмет; в столбце D – тестовый балл. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько учеников в Юго-Восточном округе (ЮВ) выбрали в качестве любимого предмета обществознание? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каков средний тестовый балл у учеников Юго-Западного округа (ЮЗ)? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, выбравших английский язык, немецкий язык, французский язык. Левый верхний угол диаграммы разместите вблизи ячейки G6.  В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 15
  },
  {
    "id": "2FFB8E",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные олимпиады по математике. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   номер участника   номер школы   класс   баллы     2   участник 1   38   8   55     3   участник 2   32   9   329     4   участник 3   30   8   252     5   участник 4   50   8   202      В столбце A записан номер участника; в столбце B – номер школы;  в столбце C – класс; в столбце D – набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько семиклассников набрали более 200 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл, полученный учениками школы № 1? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из школ № 2, 10 и 30. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 15
  },
  {
    "id": "D87A86",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки; в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какова суммарная масса грузов, перевезённых со 2 по 4 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых из города Дубки? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок 7 октября, 8 октября и 9 октября. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 15
  },
  {
    "id": "F1384B",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки; в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     На какое суммарное расстояние были произведены перевозки с 7 по  9 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых из города Осинки? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок 1 октября, 2 октября и 3 октября. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "7B0841",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные олимпиады по математике. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   номер участника   номер школы   класс   баллы     2   участник 1   38   8   55     3   участник 2   32   9   329     4   участник 3   30   8   252     5   участник 4   50   8   202      В столбце A записан номер участника; в столбце B – номер школы;  в столбце C – класс; в столбце D – набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько восьмиклассников набрали менее 210 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл, полученный учениками школы № 28? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из школ № 37, 21 и 25. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "2EB242",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о результатах тестирования. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   номер участника   баллы русский язык   баллы математика   баллы физика   баллы информатика     2   участник 1   79   81   44   85     3   участник 2   98   23   82   89     4   участник 3   48   79   88   90     5   участник 4   94   35   90   40      В столбце A записан номер участника; в столбце B – балл по русскому языку; в столбце C – балл по математике; в столбце D – балл по физике;  в столбце E – балл по информатике. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников тестирования получили по русскому языку, физике и информатике в сумме более 200 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл по математике у участников, которые набрали по информатике более 60 баллов? Ответ на этот вопрос запишите  в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, набравших 60 баллов по русскому языку, математике, физике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "52C24F",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования. Все участники набирали баллы, делая задания для левой и правой руки. Ниже приведены первые строки получившейся таблицы.        A   B   C   D   E     1   номер участника   пол   статус   левая рука   правая рука     2   участник 1   жен   пенсионер   35   34     3   участник 2   муж   студент   57   53     4   участник 3   муж   пенсионер   47   64     5   участник 4   муж   служащий   34   58    В столбце A указан номер участника, в столбце B   –   пол, в столбце C   –   один из трёх статусов: пенсионер, служащий, студент, в столбцах D, E   –   показатели тестирования для левой и правой руки. Всего в электронную таблицу были занесены данные по 1000 участникам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Каков средний показатель для правой руки у мужчин? Ответ на этот вопрос с точностью до одного знака после запятой запишите в ячейку G2 таблицы. 2.     У скольких женщин показатель для левой руки больше показателя для правой руки? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества пенсионеров, студентов и служащих. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "7C4CF7",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты тестирования учащихся по математике и физике. На рисунке приведены первые строки получившейся таблицы.        A   B   C   D     1   Ученик   Район   Математика   Физика     2   Шамшин Владислав   Майский   65   79     3   Гришин Борис   Заречный   52   30     4   Огородников Николай   Подгорный   60   27     5   Богданов Виктор   Центральный   98   86    В столбце A указаны фамилия  и имя учащегося; в столбце B – район города, в котором расположена школа учащегося; в столбцах C, D – баллы, полученные соответственно по математике и физике. По каждому предмету можно было набрать от 0 до 100 баллов. Всего в электронную таблицу были занесены данные по 1000 учащимся. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников набрали более 160 баллов в сумме по двум предметам? Ответ на этот вопрос запишите в ячейку G1 таблицы. 2.     Чему равен минимальный балл по математике у учащихся Заречного района? Ответ на этот вопрос запишите в ячейку G2 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из Заречного, Подгорного и Центрального районов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "B73CF2",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность,  Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жар.   52,0   26,0   13,4   626     4   Горох отв.   0,8   10,5   20,4   130     5   Горошек зел.   0,2   5,0   8,3   55    В столбце A записан продукт; в столбце B   –   содержание в нём жиров;  в столбце C   –   содержание белков; в столбце D   –   содержание углеводов;  в столбце E   –   калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов.   Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько продуктов содержат менее 20 г белков и более 8 г углеводов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием менее 1 г жира? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества продуктов с калорийностью менее 100 Ккал, от 100 до 400 Ккал включительно и более 400 Ккал. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "AE63F0",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные олимпиады по математике. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   номер участника   номер школы   класс   баллы     2   участник 1   38   8   55     3   участник 2   32   9   329     4   участник 3   30   8   252     5   участник 4   50   8   202      В столбце A записан номер участника; в столбце B – номер школы;  в столбце C – класс; в столбце D – набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько одиннадцатиклассников набрали более 250 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл, полученный учениками школы № 19? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из 9, 10 и 11 классов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "C7D0F2",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты мониторинга стоимости бензина трёх марок (92, 95, 98) на бензозаправках города. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Улица   Марка   Цена     2   Абельмановская   92   45,80     3   Абрамцевская   98   49,40     4   Авиамоторная   95   49,10     5   Авиаторов   95   47,70    В столбце A записано название улицы, на которой расположена бензозаправка, в столбце B   –   марка бензина, который продаётся на этой заправке (одно из чисел 92, 95, 98), в столбце C   –   стоимость бензина на данной бензозаправке (в рублях, с указанием двух знаков дробной части). На каждой улице может быть расположена только одна заправка, для каждой заправки указана только одна марка бензина. Всего в электронную таблицу были занесены данные по 1000 бензозаправкам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Какова максимальная цена бензина марки 98? Ответ на этот вопрос запишите в ячейку F2 таблицы. 2.     Сколько бензозаправок продаёт бензин марки 98 по максимальной цене в городе? Ответ на этот вопрос запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества бензозаправок, продающих бензин дешевле 47 рублей за литр, от 47 до 51 рубля за литр включительно и дороже 51 рубля за литр. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 27
  },
  {
    "id": "99A8F4",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какое среднее количество осадков выпадало за сутки в осенние месяцы (сентябрь, октябрь, ноябрь)? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Какая средняя температура была в те дни года, когда дул северный (С) ветер? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда дули ветры «В», «СВ» и «ЮВ». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "115D0E",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования. Все участники набирали баллы, выполняя задания для левой и правой руки. Ниже приведены первые строки получившейся таблицы.        A   B   C   D   E     1   номер участника   пол   статус   левая рука   правая рука     2   участник 1   жен   пенсионер   35   34     3   участник 2   муж   студент   57   53     4   участник 3   муж   пенсионер   47   64     5   участник 4   муж   служащий   34   58    В столбце A указан номер участника, в столбце B   –   пол, в столбце C   –   один из трёх статусов: пенсионер, служащий, студент, в столбцах D, E   –   показатели тестирования для левой и правой руки. Всего в электронную таблицу были занесены данные по 1000 участникам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Каков средний показатель для правой руки у служащих? Ответ на этот вопрос с точностью до двух знаков после запятой запишите в ячейку G2 таблицы. 2.     У скольких участников тестирования разница между показателями для левой и правой руки по модулю больше или равна 5? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение среднего показателя для правой руки у пенсионеров, студентов и служащих. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных с точностью до целых, по которым построена диаграмма   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "C64F0E",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования мужского пола в возрасте до 35 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 1 у участников, которые набрали за тест 2 более 20 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования мужского пола в возрасте до 35, от 35 до 50 включительно и старше 50 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "69EF00",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников по трём предметам. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   Код ученика   Район   Русский язык   Математика   Информатика     2   Ученик 1   Майский   27   36   48     3   Ученик 2   Заречный   30   51   15     4   Ученик 3   Подгорный   54   97   98     5   Ученик 4   Центральный   66   96   32    В столбце A записаны коды учеников; в столбце B – район проживания;  в столбцах C, D и E – тестовые баллы по русскому языку, математике  и информатике соответственно. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько учеников из Центрального района набрало по математике больше 60 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний тестовый балл по математике у учеников из Заречного района? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа учеников, которые набрали более 80 баллов по русскому языку, математике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "6B3D08",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов.  Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность,  Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жар.   52   26   13,4   626     4   Горох отв.   0,8   10,5   20,4   130     5   Горошек зел.   0,2   5   8,3   55    В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце E – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     У какого количества продуктов с содержанием не менее 50 г жиров калорийность превышает 500 Ккал? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием менее 10 г углеводов и менее 30 г белков? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение  количества продуктов с содержанием белков менее 10 г, от 10 до 20 г включительно и более 20 г. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "80ED0C",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты мониторинга стоимости бензина трёх марок (92, 95, 98) на бензозаправках города. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Улица   Марка   Цена     2   Абельмановская   92   45,80     3   Абрамцевская   98   49,40     4   Авиамоторная   95   49,10     5   Авиаторов   95   47,70    В столбце A записано название улицы, на которой расположена бензозаправка, в столбце B   –   марка бензина, который продаётся на этой заправке (одно из чисел 92, 95, 98), в столбце C   –   стоимость бензина на данной бензозаправке (в рублях, с указанием двух знаков дробной части). На каждой улице может быть расположена только одна заправка, для каждой заправки указана только одна марка бензина. Всего в электронную таблицу были занесены данные по 1000 бензозаправок. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Какова максимальная цена бензина марки 95? Ответ на этот вопрос запишите в ячейку F2 таблицы. 2.     Сколько бензозаправок продаёт бензин марки 95 по максимальной цене в городе? Ответ на этот вопрос запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества бензозаправок, продающих бензин дешевле 46 рублей за литр, от 46 до 49 рублей за литр включительно и дороже 49 рублей за литр. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "BD577B",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования женского пола в возрасте до 30 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 2 у участников, которые набрали за тест 1 более 30 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования женского пола в возрасте до 30, от 30 до 50 включительно и старше 50 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "D1D57E",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования мужского пола в возрасте старше 50 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 1 у участников, которые набрали за тест 2 более 15 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования мужского пола в возрасте до 25, от 25 до 50 включительно и старше 50 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "950D77",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов.  Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность,  Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жар.   52   26   13,4   626     4   Горох отв.   0,8   10,5   20,4   130     5   Горошек зел.   0,2   5   8,3   55    В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце E – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько продуктов содержат более 15 г углеводов и имеет калорийностью менее 300 Ккал? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Какова общая калорийность продуктов с содержанием менее 10 г углеводов? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение  количества продуктов с содержанием жиров менее 1 г, от 1 г до 15 г включительно и более 15 г. Левый верхний угол диаграммы разместите вблизи ячейки G6.  В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "432FB2",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты тестирования учащихся по математике и физике. На рисунке приведены первые строки получившейся таблицы.        A   B   C   D     1   Ученик   Район   Математика   Физика     2   Шамшин Владислав   Майский   65   79     3   Гришин Борис   Заречный   52   30     4   Огородников Николай   Подгорный   60   27     5   Богданов Виктор   Центральный   98   86    В столбце A указаны фамилия и имя учащегося; в столбце B – район города, в котором расположена школа учащегося; в столбцах C, D – баллы, полученные соответственно по математике и физике. По каждому предмету можно было набрать от 0 до 100 баллов. Всего в электронную таблицу были занесены данные по 1000 учащимся. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько учащихся Центрального района набрали более 70 баллов по каждому из предметов? Ответ на этот вопрос запишите в ячейку G1 таблицы. 2.     Чему равна разница между максимальным и минимальным баллами по физике среди всех учащихся? Ответ на этот вопрос запишите в ячейку G2 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из Подгорного, Кировского и Центрального районов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "A911B5",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования студентов. Ниже  приведены первые строки получившейся таблицы.        A   B   C   D     1   номер участника   пол   факультет   баллы     2   участник 1   жен.   химический   21     3   участник 2   муж.   математический   5     4   участник 3   жен.   медицинский   15     5   участник 4   муж.   математический   15     6   участник 5   муж.   экономический   24    В столбце A указан номер участника; в столбце B – пол; в столбце C – один из четырёх факультетов: математический, медицинский, химический, экономический; в столбце D – количество набранных баллов (от 5 до 25). Всего в электронную таблицу были занесены данные по 1000 участников. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания. 1.     Сколько девушек приняли участие в тестировании? Ответ на этот вопрос запишите в ячейку G2 таблицы. 2.     Чему равна разница между максимальным и минимальным баллами студентов химического факультета? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников  химического, математического и медицинского факультетов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "C442B1",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Каким было среднее значение атмосферного давления в осенние месяцы (сентябрь, октябрь, ноябрь)? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Какая средняя скорость ветра была в те дни года, когда дул восточный (В) ветер? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда дули ветры «С», «З» и «В». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "C154B5",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          А   В   С   D   Е     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность, Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жареный   52,0   26,0   13,4   626     4   Горох отварной   0,8   10,5   20,4   130     5   Горошек зелёный   0,2   5,0   8,3   55      В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце Е – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько продуктов в таблице содержат меньше 20 г углеводов  и больше 20 г белков? Запишите количество этих продуктов в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием углеводов 0 г? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение среднего количества жиров, белков и углеводов в первых  100 продуктах. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "9EC0B6",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования женского пола в возрасте старше 50 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 2 у участников, которые набрали за тест 1 менее 40 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования женского пола в возрасте до 40, от 40 до 50 включительно и старше 50 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "6A6FB8",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования студентов. Ниже приведены первые строки получившейся таблицы.        A   B   C   D     1   номер участника   пол   факультет   баллы     2   участник 1   жен.   химический   21     3   участник 2   муж.   математический   5     4   участник 3   жен.   медицинский   15     5   участник 4   муж.   математический   15     6   участник 5   муж.   экономический   24    В столбце A указан номер участника; в столбце B – пол; в столбце C – один из четырёх факультетов: математический, медицинский, химический, экономический; в столбце D – количество набранных баллов (от 5 до 25). Всего в электронную таблицу были занесены данные по 1000 участников. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания. 1.     На сколько число юношей превышает число девушек? Ответ на этот вопрос запишите в ячейку G2 таблицы. 2.     Чему равен средний балл юношей? Ответ на этот вопрос с точностью до двух знаков после запятой запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников  химического, экономического и медицинского факультетов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "33A1B0",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников по трём предметам. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   Код ученика   Район   Русский язык   Математика   Информатика     2   Ученик 1   Майский   27   36   48     3   Ученик 2   Заречный   30   51   15     4   Ученик 3   Подгорный   54   97   98     5   Ученик 4   Центральный   66   96   32    В столбце A записаны коды учеников; в столбце B – район проживания;  в столбцах C, D и E – тестовые баллы по русскому языку, математике и информатике соответственно. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько учеников набрали в сумме по русскому и математике более 140 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний тестовый балл по информатике у учеников из района Заречный? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из различных районов: Майского, Заречного, Центрального и Подгорного. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "42A91B",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли информацию о грузоперевозках, совершённых некоторым автопредприятием с 1 по 9 октября. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Пункт отправления   Пункт назначения   Расстояние   Расход бензина   Масса груза     2   1 октября   Липки   Березки   432   63   770     3   1 октября   Орехово   Дубки   121   17   670     4   1 октября   Осинки   Вязово   333   47   830     5   1 октября   Липки   Вязово   384   54   730    Каждая строка таблицы содержит запись об одной перевозке. В столбце A записана дата перевозки (от «1 октября» до «9 октября»);  в столбце B – название населённого пункта отправления перевозки; в столбце C – название населённого пункта назначения перевозки; в столбце D – расстояние, на которое была осуществлена перевозка (в километрах);  в столбце E – расход бензина на всю перевозку (в литрах); в столбце F – масса перевезённого груза (в килограммах). Всего в электронную таблицу были занесены данные по 370 перевозкам  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     На какое суммарное расстояние были произведены перевозки с 4 по  6 октября? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какова средняя масса груза при автоперевозках, осуществлённых в город Вязово? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее одного знака после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение количества перевозок в города Дубки, Липки, Орехово. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 28
  },
  {
    "id": "5D3B1B",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования. Все участники набирали баллы, выполняя задания для левой и правой руки. Ниже приведены первые строки получившейся таблицы.        A   B   C   D   E     1   номер участника   пол   статус   левая рука   правая рука     2   участник 1   жен   пенсионер   35   34     3   участник 2   муж   студент   57   53     4   участник 3   муж   пенсионер   47   64     5   участник 4   муж   служащий   34   58    В столбце A указан номер участника, в столбце B   –   пол, в столбце C   –   один из трёх статусов: пенсионер, служащий, студент, в столбцах D, E   –   показатели тестирования для левой и правой руки. Всего в электронную таблицу были занесены данные по 1000 участникам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько мужчин-студентов участвовало в тестировании? Ответ на этот вопрос запишите в ячейку G2 таблицы. 2.      Какова разница между максимальным и минимальным показателями для левой руки? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества мужчин-пенсионеров, мужчин-студентов и мужчин-служащих. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "A44326",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты тестирования учащихся по математике и физике. На рисунке приведены первые строки получившейся таблицы.        A   B   C   D     1   Ученик   Район   Математика   Физика     2   Шамшин Владислав   Майский   65   79     3   Гришин Борис   Заречный   52   30     4   Огородников Николай   Подгорный   60   27     5   Богданов Виктор   Центральный   98   86    В столбце A указаны фамилия  и имя учащегося; в столбце B – район города, в котором расположена школа учащегося; в столбцах C, D – баллы, полученные соответственно по математике и физике. По каждому предмету можно было набрать от 0 до 100 баллов. Всего в электронную таблицу были занесены данные по 1000 учащимся. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Чему равна наименьшая сумма баллов у учеников Подгорного района? Ответ на этот вопрос запишите в ячейку G2 таблицы. 2.     Сколько участников тестирования набрали одинаковое количество баллов по математике и физике? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников из Майского, Заречного и Кировского районов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "4CDCDB",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о численности населения городов разных стран. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Город   Численность населения   Страна     2   Асмун   91,40   Египет     3   Винер-Нойштадт   39,94   Австрия     4   Люлебургаз   100,79   Турция     5   Фёклабрук   11,95   Австрия    В столбце A указано название города; в столбце B – численность населения (тыс. человек); в столбце C – название страны.  Всего в электронную таблицу были занесены данные по 1000 городов. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько жителей в самом крупном по численности населения городе Египта? Ответ на этот вопрос (в тыс. человек) с точностью до двух знаков после запятой запишите в ячейку F2 таблицы. 2.     Сколько городов Египта имеют жителей больше, чем средняя численность населения городов, представленных в таблице? Ответ на этот вопрос запишите в ячейку F3. 3.     Постройте круговую диаграмму, отображающую соотношение количества городов Швейцарии, Канады и Германии, представленных  в таблице. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "4929DD",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о численности населения городов разных стран. Ниже приведены первые пять строк таблицы.          A   B   C     1   Город   Численность населения   Страна     2   Асмун   91,40   Египет     3   Винер-Нойштадт   39,94   Австрия     4   Люлебургаз   100,79   Турция     5   Фёклабрук   11,95   Австрия    В столбце A указано название города; в столбце B – численность населения (тыс. человек); в столбце C – название страны. Всего в электронную таблицу были занесены данные по 1000 городов Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько городов, представленных в таблице, имеют численность населения менее 100 тыс. человек? Ответ запишите в ячейку F2. 2.      Чему равна средняя численность населения австрийских городов, представленных в таблице? Ответ на этот вопрос с точностью не менее двух знаков после запятой (в тыс. человек) запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества городов Австрии, Мальты и Туниса, представленных  в таблице. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "08ABD9",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.          A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Каким было среднее значение атмосферного давления в весенние месяцы (март, апрель, май)? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какое среднее количество осадков выпадало за сутки в те дни года, когда дул северо-западный (СЗ) ветер? Ответ на этот вопрос запишите в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда давление было 760, 759 и 758 мм рт. ст. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "9D58D0",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о результатах тестирования. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   номер участника   баллы русский язык   баллы математика   баллы физика   баллы информатика     2   участник 1   79   81   44   85     3   участник 2   98   23   82   89     4   участник 3   48   79   88   90     5   участник 4   94   35   90   40      В столбце A записан номер участника; в столбце B – балл по русскому языку; в столбце C – балл по математике; в столбце D – балл по физике;  в столбце E – балл по информатике. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников тестирования получили по русскому языку  и математике в сумме более 140 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл по информатике у участников, которые набрали по физике более 60 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, набравших 95 баллов по русскому языку, математике, физике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "BD625E",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования. Все участники набирали баллы, делая задания для левой и правой руки. Ниже приведены первые строки получившейся таблицы.        A   B   C   D   E     1   номер участника   пол   статус   левая рука   правая рука     2   участник 1   жен   пенсионер   35   34     3   участник 2   муж   студент   57   53     4   участник 3   муж   пенсионер   47   64     5   участник 4   муж   служащий   34   58    В столбце A указан номер участника, в столбце B   –   пол, в столбце C   –   один из трёх статусов: пенсионер, служащий, студент, в столбцах D, E   –   показатели тестирования для левой и правой руки. Всего в электронную таблицу были занесены данные по 1000 участникам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Каков средний показатель для левой руки у женщин? Ответ на этот вопрос с точностью до одного знака после запятой запишите в ячейку G2 таблицы. 2.     У скольких мужчин показатель для левой руки больше показателя для правой руки? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение среднего показателя для левой руки у женщин, для правой руки у женщин, для левой руки у мужчин и для правой руки у мужчин. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных с точностью до целых, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "C2FA51",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования студентов. Ниже  приведены первые строки получившейся таблицы.        A   B   C   D     1   номер участника   пол   факультет   баллы     2   участник 1   жен.   химический   21     3   участник 2   муж.   математический   5     4   участник 3   жен.   медицинский   15     5   участник 4   муж.   математический   15     6   участник 5   муж.   экономический   24    В столбце A указан номер участника; в столбце B – пол; в столбце C – один из четырёх факультетов: математический, медицинский, химический, экономический; в столбце D – количество набранных баллов (от 5 до 25). Всего в электронную таблицу были занесены данные по 1000 участников. Порядок записей в таблице произвольный. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания. 1.     Сколько участников набрали более 20 баллов? Ответ на этот вопрос запишите в ячейку G2 таблицы. 2.     На сколько баллов отличается средний балл студентов экономического факультета от общего среднего балла? Ответ на этот вопрос с точностью до двух знаков после запятой запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников экономического, математического и медицинского факультетов. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 29
  },
  {
    "id": "1A7DAD",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   округ   код ученика   любимый предмет   балл     2   С   Ученик 1   обществознание   246     3   В   Ученик 2   немецкий язык   530     4   Ю   Ученик 3   русский язык   576     5   СВ   Ученик 4   обществознание   304      В столбце A записан округ, в котором учится ученик; в столбце B – код ученика; в столбце C – любимый предмет; в столбце D – тестовый балл. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько учеников в Южном округе (Ю) выбрали в качестве любимого предмета английский язык? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний тестовый балл у учеников Юго-Восточного округа (ЮВ)? Ответ на этот вопрос запишите в ячейку H3 таблицы  с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, выбравших биологию, географию, химию. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "D7D0A7",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты мониторинга стоимости бензина трёх марок (92, 95, 98) на бензозаправках города. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Улица   Марка   Цена     2   Абельмановская   92   45,80     3   Абрамцевская   98   49,40     4   Авиамоторная   95   49,10     5   Авиаторов   95   47,70    В столбце A записано название улицы, на которой расположена бензозаправка, в столбце B   –   марка бензина, который продаётся на этой заправке (одно из чисел 92, 95, 98), в столбце C   –   стоимость бензина на данной бензозаправке (в рублях, с указанием двух знаков дробной части). На каждой улице может быть расположена только одна заправка, для каждой заправки указана только одна марка бензина. Всего в электронную таблицу были занесены данные по 1000 бензозаправок. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Какова минимальная цена бензина марки 98? Ответ на этот вопрос запишите в ячейку F2 таблицы. 2.     Сколько бензозаправок продаёт бензин марки 98 по минимальной цене в городе? Ответ на этот вопрос запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества бензозаправок, продающих бензин дешевле 47 рублей за литр, от 47 до 50 рублей за литр включительно и дороже 50 рублей за литр. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "44BBC1",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования мужского пола в возрасте старше 60 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 1 у участников, которые набрали за тест 2 менее 45 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования мужского пола в возрасте до 30, от 30 до 60 включительно и старше 60 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "BAB4CC",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          А   В   С   D   Е     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность, Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жареный   52,0   26,0   13,4   626     4   Горох отварной   0,8   10,5   20,4   130     5   Горошек зелёный   0,2   5,0   8,3   55      В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце Е – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько продуктов в таблице содержат меньше 25 г жиров  и меньше 25 г углеводов? Запишите количество этих продуктов  в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием белков больше 20 г? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение среднего количества жиров, белков и углеводов во второй сотне продуктов (номера 102–201). Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "C957C2",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования женского пола в возрасте до 35 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 2 у участников, которые набрали за тест 1 более 20 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования женского пола в возрасте до 35, от 35 до 50 включительно и старше 50 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "10FA9D",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты мониторинга стоимости бензина трёх марок (92, 95, 98) на бензозаправках города. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Улица   Марка   Цена     2   Абельмановская   92   45,80     3   Абрамцевская   98   49,40     4   Авиамоторная   95   49,10     5   Авиаторов   95   47,70    В столбце A записано название улицы, на которой расположена бензозаправка, в столбце B   –   марка бензина, который продаётся на этой заправке (одно из чисел 92, 95, 98), в столбце C   –   стоимость бензина на данной бензозаправке (в рублях, с указанием двух знаков дробной части). На каждой улице может быть расположена только одна заправка, для каждой заправки указана только одна марка бензина. Всего в электронную таблицу были занесены данные по 1000 бензозаправок. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Какова максимальная цена бензина марки 92? Ответ на этот вопрос запишите в ячейку F2 таблицы. 2.     Сколько бензозаправок продаёт бензин марки 92 по максимальной цене в городе? Ответ на этот вопрос запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества бензозаправок, продающих бензин дешевле 45 рублей за литр, от 45 до 50 рублей за литр включительно и дороже 50 рублей за литр. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "624596",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования. Все участники набирали баллы, выполняя задания для левой и правой руки. Ниже приведены первые строки получившейся таблицы.        A   B   C   D   E     1   номер участника   пол   статус   левая рука   правая рука     2   участник 1   жен   пенсионер   35   34     3   участник 2   муж   студент   57   53     4   участник 3   муж   пенсионер   47   64     5   участник 4   муж   служащий   34   58    В столбце A указан номер участника, в столбце B   –   пол, в столбце C   –   один из трёх статусов: пенсионер, служащий, студент, в столбцах D, E   –   показатели тестирования для левой и правой руки. Всего в электронную таблицу были занесены данные по 1000 участникам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Каков средний показатель для левой руки у студентов? Ответ на этот вопрос с точностью до двух знаков после запятой запишите в ячейку G2 таблицы. 2.     У скольких участников тестирования разница между показателями для левой и правой руки по модулю меньше 5? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение среднего показателя для левой руки у пенсионеров, студентов и служащих. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных с точностью до целых, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "48BAE1",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о результатах тестирования. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   номер участника   баллы русский язык   баллы математика   баллы физика   баллы информатика     2   участник 1   79   81   44   85     3   участник 2   98   23   82   89     4   участник 3   48   79   88   90     5   участник 4   94   35   90   40      В столбце A записан номер участника; в столбце B – балл по русскому языку; в столбце C – балл по математике; в столбце D – балл по физике;  в столбце E – балл по информатике. Всего в электронную таблицу были занесены данные по 1000 участников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько участников тестирования получили по русскому языку  и физике в сумме более 140 баллов? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каков средний балл по информатике у участников, которые набрали по математике более 60 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, набравших 50 баллов по русскому языку, математике, физике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "056FE4",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          А   В   С   D   Е     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность, Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жареный   52,0   26,0   13,4   626     4   Горох отварной   0,8   10,5   20,4   130     5   Горошек зелёный   0,2   5,0   8,3   55      В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце Е – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько продуктов в таблице содержат меньше 5 г жиров и меньше 5 г белков? Запишите количество этих продуктов в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием жиров 0 г? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение среднего количества жиров, белков и углеводов в продуктах. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "B2EBEB",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о калорийности продуктов. Ниже приведены первые пять строк таблицы.          А   В   С   D   Е     1   Продукт   Жиры, г   Белки, г   Углеводы, г   Калорийность, Ккал     2   Арахис   45,2   26,3   9,9   552     3   Арахис жареный   52,0   26,0   13,4   626     4   Горох отварной   0,8   10,5   20,4   130     5   Горошек зелёный   0,2   5,0   8,3   55      В столбце A записан продукт; в столбце B – содержание в нём жиров;  в столбце C – содержание белков; в столбце D – содержание углеводов;  в столбце Е – калорийность этого продукта. Всего в электронную таблицу были занесены данные по 1000 продуктов. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько продуктов в таблице содержат меньше 7 г жиров и меньше 7 г белков? Запишите количество этих продуктов в ячейку H2 таблицы. 2.     Какова средняя калорийность продуктов с содержанием жиров более 50 г? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение суммарного количества жиров, белков и углеводов в первых  100 продуктах. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным)  и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "E163E6",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные наблюдения за погодой в течение одного года. Ниже приведены первые пять строк таблицы.        A   B   C   D   E   F     1   Дата   Температура   Осадки   Давление   Ветер   Скорость ветра     2   1 января   0,7   15,2   748   ЮВ   4,2     3   2 января   0,4   4,6   751   В   4,7     4   3 января   –1,9   1,4   747   С   2,4     5   4 января   –7,7   0,2   752   З   4,7    В столбце A записана дата наблюдения; в столбце B – среднесуточная температура воздуха для указанной даты; в столбце C – количество выпавших осадков (в миллиметрах) для указанной даты; в столбце D – среднесуточное атмосферное давление (в миллиметрах ртутного столба).  В столбце E записано направление ветра для указанной даты – одно из восьми возможных значений: «СЗ», «С», «СВ», «В», «ЮВ», «Ю», «ЮЗ», «З». В столбце F записана среднесуточная скорость ветра (в метрах в секунду). Всего в электронную таблицу были занесены данные по всем 365 дням года  в хронологическом порядке. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Какой была средняя температура воздуха в весенние месяцы (март, апрель, май)? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Какое среднее количество осадков выпадало за сутки в те дни года, когда дул южный (Ю) ветер? Ответ на этот вопрос запишите  в ячейку H3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества дней, когда дули ветры «С», «СЗ» и «СВ». Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Ответы должны быть вычислены с точностью не менее двух знаков после запятой. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 30
  },
  {
    "id": "62A663",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты мониторинга стоимости бензина трёх марок (92, 95, 98) на бензозаправках города. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Улица   Марка   Цена     2   Абельмановская   92   45,80     3   Абрамцевская   98   49,40     4   Авиамоторная   95   49,10     5   Авиаторов   95   47,70    В столбце A записано название улицы, на которой расположена бензозаправка, в столбце B   –   марка бензина, который продаётся на этой заправке (одно из чисел 92, 95, 98), в столбце C   –   стоимость бензина на данной бензозаправке (в рублях, с указанием двух знаков дробной части). На каждой улице может быть расположена только одна заправка, для каждой заправки указана только одна марка бензина. Всего в электронную таблицу были занесены данные по 1000 бензозаправкам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Какова минимальная цена бензина марки 92? Ответ на этот вопрос запишите в ячейку F2 таблицы. 2.     Сколько бензозаправок продаёт бензин марки 92 по минимальной цене в городе? Ответ на этот вопрос запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества бензозаправок, продающих бензин дешевле 46 рублей за литр, от 46 до 51 рубля за литр включительно и дороже 51 рубля за литр. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 31
  },
  {
    "id": "504A31",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты анонимного тестирования. Все участники набирали баллы, выполняя задания для левой и правой руки. Ниже приведены первые строки получившейся таблицы.        A   B   C   D   E     1   номер участника   пол   статус   левая рука   правая рука     2   участник 1   жен   пенсионер   35   34     3   участник 2   муж   студент   57   53     4   участник 3   муж   пенсионер   47   64     5   участник 4   муж   служащий   34   58    В столбце A указан номер участника, в столбце B   –   пол, в столбце C   –   один из трёх статусов: пенсионер, служащий, студент, в столбцах D, E   –   показатели тестирования для левой и правой руки. Всего в электронную таблицу были занесены данные по 1000 участникам. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько женщин-пенсионеров участвовало в тестировании? Ответ на этот вопрос запишите в ячейку G2 таблицы. 2.      Какова разница между максимальным и минимальным показателями для правой руки? Ответ на этот вопрос запишите в ячейку G3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества женщин-пенсионеров, женщин-студентов и женщин-служащих. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.       \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 31
  },
  {
    "id": "50BA32",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников. Ниже приведены первые пять строк таблицы.          A   B   C   D     1   округ   код ученика   любимый предмет   балл     2   С   Ученик 1   обществознание   246     3   В   Ученик 2   немецкий язык   530     4   Ю   Ученик 3   русский язык   576     5   СВ   Ученик 4   обществознание   304      В столбце A записан округ, в котором учится ученик; в столбце B – код ученика; в столбце C – любимый предмет; в столбце D – тестовый балл. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, ответьте на два вопроса. 1.     Сколько учеников в Юго-Западном округе (ЮЗ) выбрали в качестве любимого предмета обществознание? Ответ на этот вопрос запишите  в ячейку H2 таблицы. 2.     Каков средний тестовый балл у учеников Центрального округа (Ц)? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников, выбравших информатику, математику и физику. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 31
  },
  {
    "id": "31C737",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли результаты мониторинга стоимости бензина трёх марок (92, 95, 98) на бензозаправках города. На рисунке приведены первые строки получившейся таблицы.        A   B   C     1   Улица   Марка   Цена     2   Абельмановская   92   45,80     3   Абрамцевская   98   49,40     4   Авиамоторная   95   49,10     5   Авиаторов   95   47,70    В столбце A записано название улицы, на которой расположена бензозаправка, в столбце B   –   марка бензина, который продаётся на этой заправке (одно из чисел 92, 95, 98), в столбце C   –   стоимость бензина на данной бензозаправке (в рублях, с указанием двух знаков дробной части). На каждой улице может быть расположена только одна заправка, для каждой заправки указана только одна марка бензина. Всего в электронную таблицу были занесены данные по 1000 бензозаправок. Порядок записей в таблице произвольный.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Какова минимальная цена бензина марки 95? Ответ на этот вопрос запишите в ячейку F2 таблицы. 2.     Сколько бензозаправок продаёт бензин марки 95 по минимальной цене в городе? Ответ на этот вопрос запишите в ячейку F3 таблицы. 3.     Постройте круговую диаграмму, отображающую соотношение количества бензозаправок, продающих бензин дешевле 46 рублей за литр, от 46 до 50 рублей за литр включительно и дороже 50 рублей за литр. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 31
  },
  {
    "id": "4B388B",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования мужского пола в возрасте до 25 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 2 у участников, которые набрали за тест 1 более 10 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования мужского пола в возрасте до 25, от 25 до 60 включительно и старше 60 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.     \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 31
  },
  {
    "id": "DCD888",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании учеников по трём предметам. Ниже приведены первые пять строк таблицы.          A   B   C   D   E     1   Код ученика   Район   Русский язык   Математика   Информатика     2   Ученик 1   Майский   27   36   48     3   Ученик 2   Заречный   30   51   15     4   Ученик 3   Подгорный   54   97   98     5   Ученик 4   Центральный   66   96   32      В столбце A записаны коды учеников; в столбце B – район проживания;  в столбцах C, D и E – тестовые баллы по русскому языку, математике  и информатике соответственно. Всего в электронную таблицу были занесены данные по 1000 учеников. Откройте файл с данной электронной таблицей (расположение файла Вам сообщат организаторы экзамена). На основании данных, содержащихся  в этой таблице, выполните задания. 1.     Сколько учеников из Подгорного района набрали по математике менее 40 баллов? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний тестовый балл по русскому языку у учеников, которые по информатике набрали более 80 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа учеников, которые набрали менее 50 баллов по русскому языку, математике и информатике. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма. Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена. \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 31
  },
  {
    "id": "985E81",
    "type": "Дайте развернутый ответ.",
    "text": "\n В электронную таблицу занесли данные о тестировании людей разного возраста.        A   B   C   D   E     1   номер участника   пол   возраст   тест 1   тест 2     2   участник 1   жен   16   31   48     3   участник 2   муж   25   14   40     4   участник 3   муж   16   35   18     5   участник 4   муж   73   9   24    В столбце A записан номер участника; в столбце B   –   пол; в столбце C   –   возраст; в столбце D   –   балл за тест 1; в столбце E   –   балл за тест 2. Всего в электронную таблицу были занесены данные по 1000 участников.   Откройте файл с данной электронной таблицей (расположение файла вам сообщат организаторы экзамена). На основании данных, содержащихся в этой таблице, выполните задания.   1.     Сколько участников тестирования женского пола в возрасте до 25 лет? Ответ на этот вопрос запишите в ячейку H2 таблицы. 2.     Каков средний балл за тест 2 у участников, которые набрали за тест 1 менее 20 баллов? Ответ на этот вопрос запишите в ячейку H3 таблицы с точностью не менее двух знаков после запятой. 3.     Постройте круговую диаграмму, отображающую соотношение числа участников тестирования женского пола в возрасте до 25, от 25 до 50 включительно и старше 50 лет. Левый верхний угол диаграммы разместите вблизи ячейки G6. В поле диаграммы должны присутствовать легенда (обозначение, какой сектор диаграммы соответствует каким данным) и числовые значения данных, по которым построена диаграмма.   Полученную таблицу необходимо сохранить под именем, указанным организаторами экзамена.   \n\n\n \n\n\n",
    "image": null,
    "topic": "4.5 Условные вычисления в электронных таблицах. Суммирование и подсчёт значений, отвечающих заданному условию. Обработка больших наборов данных. Численное моделирование в электронных таблицах",
    "page": 31
  }
]