[
  {
    "id": "8C5A88",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых файлов.    В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество троек последовательности, в которых все числа одного знака, при этом произведение минимального и максимального элементов тройки больше квадрата минимального элемента последовательности, который оканчивается на 15 и является трёхзначным числом. В ответе запишите количество найденных троек чисел, затем минимальное из произведений максимального и минимального элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности. \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/71E8FCF27FA3897C45187891E2ED27BF(copy1)/xs3qstsrcFFF8A9092DD89233458E1EC65B26F3BD_2_1747048875.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 19
  },
  {
    "id": "CBF8FC",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       В кондитерской есть N круглых форм для коржей. Специализация кондитерской – многоярусные торты, в которых диаметр каждого верхнего коржа меньше диаметра предыдущего. Один корж можно поместить на другой, если его диаметр хотя бы на 4 единицы меньше диаметра другого коржа. Определите наибольшее количество коржей, которое можно использовать для создания многоярусного торта, и максимально возможный диаметр самого маленького коржа.   Входные данные В первой строке входного файла находится число N – количество форм для коржей в кондитерской (натуральное число, не превышающее 10 000). В следующих N строках находятся значения диаметров форм для коржей (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Диаметр формы равен диаметру коржа, который выпекается в этой в форме. Запишите в ответе два целых числа: сначала наибольшее количество коржей, которое можно использовать для создания одного многоярусного торта, затем – максимально возможный диаметр самого маленького коржа в таком торте.   Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коржей и случая, когда минимальная допустимая разница между диаметрами коржей, подходящих для изготовления многоярусного торта, составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коржей с диаметрами 30, 40 и 43 или 32, 40 и 43 соответственно, т.е. количество коржей равно 3, а максимально возможный диаметр самого маленького коржа равен 32.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/976332A34F9F9CFF44DB299BC61A7C46(copy1)/xs3qstsrc976332A34F9F9CFF44DB299BC61A7C46_4_1707813764.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 37
  },
  {
    "id": "6689F3",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.     При онлайн-покупке билета на концерт известно, какие места в зале уже заняты. Необходимо купить два билета на такие соседние места в одном ряду, чтобы перед ними все кресла с такими же номерами были свободны, а ряд находился как можно дальше от сцены. Если в этом ряду таких пар мест несколько, найдите пару с наибольшими номерами. В ответе запишите два целых числа: искомый номер ряда и наибольший номер места в найденной паре. Нумерация рядов и мест ведётся с 1. Гарантируется, что хотя бы одна такая пара в зале есть.   Входные данные  В первой строке входного файла находятся три числа: N – количество занятых мест в зале (целое положительное число,  не превышающее 10 000), M – количество рядов (целое положительное число, не превышающее 100 000) и K – количество мест в каждом ряду (целое положительное число, не превышающее 100 000). В следующих N строках находятся пары натуральных чисел: номер ряда и номер места занятого кресла соответственно (первое число не превышает значения M, а второе – K). Выходные данные Два целых положительных числа: наибольший номер ряда и наибольший номер места в найденной паре кресел.   Типовой пример организации данных во входном файле 7 7 8 1 1 6 6 5 5 6 7 4 4 2 2 3 3 При таких исходных данных ответом является пара чисел 5 и 8. Условию задачи удовлетворяют места 7 и 8 в ряду 5: перед креслами 7 и 8 нет занятых мест и это последняя из двух возможных пар в этом ряду. В рядах 6 и 7 искомую пару найти нельзя.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемого файла.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/73D65726180A95E74396BEB05AFF6F96(copy1)/xs3qstsrc1DEFDBA81BE98DE24B1F220B6475F43C_6_1721382822.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 37
  },
  {
    "id": "EDE407",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       Входной файл содержит сведения о заявках на проведение мероприятий в конференц-зале. В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток). Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них. Если время окончания одного мероприятия совпадает со временем начала другого, то провести можно оба. Определите, какое максимальное количество мероприятий можно провести в конференц-зале, и каков при этом максимально возможный перерыв между двумя последними мероприятиями. Входные данные В первой строке входного файла находится натуральное число N (N ≤ 1000) – количество заявок на проведение мероприятий. Следующие N строк содержат пары чисел, обозначающих время начала и время окончания мероприятий. Каждое из чисел натуральное, не превосходящее 1440. Запишите в ответе два числа: максимальное количество мероприятий и самый длинный перерыв между двумя последними мероприятиями (в минутах).   Типовой пример организации данных во входном файле 5 10 150 100 120 131 170 150 180 120 130 При таких исходных данных можно провести максимум три мероприятия, например, мероприятия по заявкам 2, 3 и 5. Максимальный перерыв между двумя последними мероприятиями составит 20 мин., если состоятся мероприятия по заявкам 2, 4 и 5.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/9FE26E672E7BA99540E4B89D2E1A28AB(copy1)/xs3qstsrc9FE26E672E7BA99540E4B89D2E1A28AB_5_1678707566.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 37
  },
  {
    "id": "B1F57A",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 11 единиц меньше длины стороны другой коробки. Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой коробки, где будет находиться подарок. Размер подарка позволяет поместить его в самую маленькую коробку. Входные данные В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, затем максимально возможную длину стороны самой маленькой коробки в таком наборе.  Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коробок и случая, когда минимальная допустимая разница между длинами сторон коробок, подходящих для упаковки «матрёшкой», составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коробок с длинами сторон 30, 40 и 43 или 32, 40  и 43 соответственно, т.е. количество коробок равно 3, а длина стороны самой маленькой коробки равна 32. Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/35FDF65AED448D17483D6A57DBB1A4CF(copy2)/xs3qstsrc35FDF65AED448D17483D6A57DBB1A4CF_4_1646141659.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 37
  },
  {
    "id": "AD6F70",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.     При онлайн-покупке билета на концерт известно, какие места в зале уже заняты. Необходимо купить два билета на такие соседние места в одном ряду, чтобы перед ними все кресла с такими же номерами были свободны, а ряд находился как можно дальше от сцены. Если в этом ряду таких пар мест несколько, найдите пару с наименьшими номерами. В ответе запишите два целых числа: искомый номер ряда и наименьший номер места в найденной паре. Нумерация рядов и мест ведётся с 1. Гарантируется, что хотя бы одна такая пара в зале есть.   Входные данные  В первой строке входного файла находятся три числа: N – количество занятых мест в зале (целое положительное число,  не превышающее 10 000), M – количество рядов (целое положительное число, не превышающее 100 000) и K – количество мест в каждом ряду (целое положительное число, не превышающее 100 000). В следующих N строках находятся пары натуральных чисел: номер ряда и номер места занятого кресла соответственно (первое число не превышает значения M, а второе – K). Выходные данные Два целых положительных числа: наибольший номер ряда и наименьший номер места в найденной паре кресел.   Типовой пример организации данных во входном файле 7 7 8 1 1 6 6 5 5 6 7 4 4 2 2 3 3 При таких исходных данных ответом является пара чисел 5 и 6. Условию задачи удовлетворяют места 6 и 7 в ряду 5: перед креслами 6 и 7 нет занятых мест и это первая из двух возможных пар в этом ряду. В рядах 6 и 7 искомую пару найти нельзя.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемого файла.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/7D03ED890D04AEE84E03F4E86A77E1E2(copy1)/xs3qstsrc392D71F19549830C488E20D1BDA438E6_6_1721382115.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 38
  },
  {
    "id": "7257B4",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.     Во время сессии студенты сдают 4 экзамена, за каждый из которых можно получить от 2 до 5 баллов. Студенты, получившие хотя бы одну «двойку», считаются не сдавшими сессию. Результаты сессии публикуются в виде рейтингового списка, в котором сначала указаны идентификационные номера студентов (ID), сдавших сессию, в порядке убывания среднего балла за сессию, а в случае равенства средних баллов – в порядке возрастания ID. Затем располагаются ID студентов, не сдавших сессию: сначала –получивших одну «двойку», затем – две «двойки», потом ID студентов с тремя «двойками» и, наконец, ID студентов, получивших по 2 балла за каждый из экзаменов. Если студенты имеют одинаковое количество «двоек», то их ID в рейтинге располагаются в порядке возрастания. Повышенную стипендию получают студенты, занявшие в рейтинговом списке первые 25 % мест, при условии отсутствия у них «двоек». Гарантируется, что без «двоек» сессию сдали не менее 25 % студентов. Найдите ID студента, который занимает последнее место среди студентов с повышенной стипендией, а также ID первого в рейтинговом списке студента, который имеет более двух «двоек». В ответе запишите два целых положительных числа: сначала ID студента, который занимает последнее место среди студентов с повышенной стипендией, затем ID первого в рейтинговом списке студента, который имеет более двух «двоек».   Входные данные  В первой строке входного файла находится число N, обозначающее количество студентов (целое положительное число, не превышающее 10 000). Каждая из следующих N строк содержит 5 чисел через пробел: ID студента (целое положительное число, не превышающее 100 000) и четыре оценки, полученные им за сессию. Гарантируется, что общее число студентов N кратно 4 и хотя бы один студент имеет более двух «двоек». Во входном файле все ID различны. Выходные данные  Два натуральных числа: искомые ID студентов в порядке, указанном в условии задачи.   Типовой пример организации данных во входном файле 8 4 4 4 4 4 7 5 5 5 2 10 3 4 4 5 1 4 4 4 3 6 3 5 5 3 2 2 2 2 2 13 2 2 2 3 3 3 3 3 3 При таких исходных данных рейтинговый список ID имеет вид: 4 6 10 1 3 7 13 2. Ответ: 6 13.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемого файла.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/465950CE968EA98644648B8BF1FC2967(copy1)/xs3qstsrc430863F617B2A73745DD58E7BA07D470_6_1721744758.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 38
  },
  {
    "id": "1F25B2",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 13 единиц меньше длины стороны другой коробки. Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой коробки, где будет находиться подарок. Размер подарка позволяет поместить его в самую маленькую коробку. Входные данные В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, затем максимально возможную длину стороны самой маленькой коробки в таком наборе.  Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коробок и случая, когда минимальная допустимая разница между длинами сторон коробок, подходящих для упаковки «матрёшкой», составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коробок с длинами сторон 30, 40 и 43 или 32, 40  и 43 соответственно, т.е. количество коробок равно 3, а длина стороны самой маленькой коробки равна 32. Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/D5BAB1F9E9A19541446F4819D1A37378(copy2)/xs3qstsrcD5BAB1F9E9A19541446F4819D1A37378_4_1646206811.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 38
  },
  {
    "id": "72EC10",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       Входной файл содержит сведения о заявках на проведение мероприятий в конференц-зале. В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток). Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них. Если время окончания одного мероприятия совпадает со временем начала другого, то провести можно оба. Определите максимальное количество мероприятий, которые можно провести в конференц-зале, и самое позднее время окончания последнего мероприятия. Входные данные В первой строке входного файла находится натуральное число N (N ≤ 1000) – количество заявок на проведение мероприятий. Следующие N строк содержат пары чисел, обозначающих время начала и время окончания мероприятий. Каждое из чисел натуральное, не превосходящее 1440. Запишите в ответе два числа: максимальное количество мероприятий и самое позднее время окончания последнего мероприятия (в минутах от начала суток).   Типовой пример организации данных во входном файле 5 10 150 100 110 131 170 131 180 120 130 При таких исходных данных можно провести максимум три мероприятия, например, по заявкам 2, 3 и 5. Конференц-зал освободится самое позднее на 180-й минуте, если состоятся мероприятия по заявкам 2, 4 и 5.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/D3EEDEE8BFAC8D52454A06453DD8D197(copy1)/xs3qstsrcD3EEDEE8BFAC8D52454A06453DD8D197_5_1678707559.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 38
  },
  {
    "id": "290F15",
    "type": "Впишите правильный ответ.",
    "text": "\n \n\n\n\n\n\n\nЗадание выполняется с использованием прилагаемых  файлов.\n\n\n\n\n \nВходной файл содержит заявки пассажиров, желающих сдать свой багаж в камеру хранения. В заявке указаны время сдачи багажа и время освобождения ячейки (в минутах от начала суток). Багаж одного пассажира размещается в одной свободной ячейке с минимальным номером. Ячейки пронумерованы начиная с единицы. Размещение багажа в ячейке или её освобождение происходит в течение 1 мин. Багаж можно поместить в только что освобождённую ячейку начиная со следующей минуты. Если в момент сдачи багажа свободных ячеек нет, то пассажир уходит. Определите, сколько пассажиров сможет сдать свой багаж в течение 24 ч и какой номер будет иметь ячейка, которую займут последней. Если таких ячеек несколько, укажите минимальный номер ячейки.\nВходные данные\nВ первой строке входного файла находится натуральное число K, не превышающее 1000, – количество ячеек в камере хранения. Во второй строке – натуральное число N (N ≤ 1000), обозначающее количество пассажиров. Каждая из следующих N строк содержит два натуральных числа, каждое из которых не превышает 1440: указанное в заявке время размещения багажа в ячейке и время освобождения ячейки (в минутах от начала суток).\nЗапишите в ответе два числа: количество пассажиров, которые смогут воспользоваться камерой хранения, и номер последней занятой ячейки.\nТиповой пример организации данных во входном файле\n2\n5\n30 60\n40 1000\n59 60\n61 1000\n1010 1440\nПри таких исходных данных положить вещи в камеру хранения смогут первый, второй, четвёртый и пятый пассажиры. Последний пассажир положит вещи в ячейку 1, так как ячейки 1 и 2 будут свободны.\nТиповой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.\n\n\n\n\n \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/68DA0329E2C2A7854E360859656F80B1(copy1)/xs3qstsrc68DA0329E2C2A7854E360859656F80B1_4_1676287696.png','",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 38
  },
  {
    "id": "EB601E",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.     Каждый кандидат в отряд космонавтов проходит 3 испытания,  за каждое из которых можно получить от 0 до 100 баллов. Кроме того, можно получить дополнительно от 0 до 10 баллов по итогам собеседования. Каждому кандидату присваивается уникальный идентификационный номер (ID) – натуральное число, не превышающее 100 000. В отряде имеется фиксированное число мест, на которые кандидаты зачисляются в порядке убывания их номера в рейтинговом списке. Рейтинговый список формируется по убыванию суммы набранных баллов, включая баллы за собеседование. При равенстве сумм баллов в рейтинговом списке выше стоит участник с бóльшими баллами за собеседование, а при равенстве и этих баллов – с меньшим ID. Минимальная сумма баллов, с которой зачисляются в отряд все, её набравшие, называется проходным баллом. Гарантируется, что всегда есть участники, набравшие проходной балл. Если после зачисления всех кандидатов с проходным баллом в отряде остались места, на которые претендуют несколько кандидатов с одинаковой суммой баллов, то такая сумма баллов называется полупроходным баллом, в противном случае полупроходной балл отсутствует. В ответе запишите два целых числа: сначала ID кандидата, который последним из рейтингового списка набрал проходной балл, затем количество кандидатов, набравших полупроходной балл. Если полупроходной балл отсутствует, то второе число в ответе должно быть равно нулю.   Входные данные В первой строке входного файла находятся два натуральных числа, не превышающих 10 000, через пробел: число N – количество кандидатов и число K – количество мест в отряде. В следующих N строках находятся по 5 чисел через пробел: ID кандидата (натуральное число, не превышающее 100 000) и четыре целых неотрицательных числа – сначала результаты испытаний, затем результат собеседования.  Выходные данные  Два числа: сначала ID кандидата, который последним  из рейтингового списка набрал проходной балл, затем количество кандидатов, набравших полупроходной балл.   Типовой пример организации данных во входном файле 6 4 4 80 80 80 0 7 50 80 100 10 11 80 80 70 10 10 100 100 100 2 6 90 90 90 9 2 70 80 80 8 При таких исходных данных рейтинговый список из ID составлен следующим образом: 10 6 7 11 4 2. Два кандидата с баллами 302 и 279 зачислены, проходной балл 279. На оставшиеся два места претендуют три человека, набравшие по 240 баллов, хотя из троих будут зачислены только двое. Таким образом, 240 – полупроходной балл. Ответ: 6 3.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемого файла.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/B92C24BDB386815646DEA5C20DB15E22(copy1)/xs3qstsrc5CCD42C7A4CAB3E04A765A9D7E7CC32A_6_1721395114.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 38
  },
  {
    "id": "B42224",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       Входной файл содержит сведения о заявках на проведение мероприятий в конференц-зале. В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток). Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них. Если время окончания одного мероприятия совпадает со временем начала другого, то провести можно оба. Определите, какое максимальное количество мероприятий можно провести в конференц-зале, и каков при этом максимально возможный перерыв между двумя последними мероприятиями. Входные данные В первой строке входного файла находится натуральное число N (N ≤ 1000) – количество заявок на проведение мероприятий. Следующие N строк содержат пары чисел, обозначающих время начала и время окончания мероприятий. Каждое из чисел натуральное, не превосходящее 1440. Запишите в ответе два числа: максимальное количество мероприятий и самый длинный перерыв между двумя последними мероприятиями (в минутах).   Типовой пример организации данных во входном файле 5 10 150 100 120 131 170 150 180 120 130 При таких исходных данных можно провести максимум три мероприятия, например, мероприятия по заявкам 2, 3 и 5. Максимальный перерыв между двумя последними мероприятиями составит 20 мин., если состоятся мероприятия по заявкам 2, 4 и 5.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/4947B0BB146CAA4049CA145A79B0EAF3(copy1)/xs3qstsrc4947B0BB146CAA4049CA145A79B0EAF3_5_1678707579.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 38
  },
  {
    "id": "BDC5D0",
    "type": "Впишите правильный ответ.",
    "text": "\n           Задание выполняется с использованием прилагаемых к заданию файлов.      На грузовом судне необходимо перевезти контейнеры, имеющие одинаковый габарит и разные массы. Общая масса всех контейнеров превышает грузоподъёмность судна. Количество грузовых мест на судне не меньше количества контейнеров, назначенных к перевозке. Какое максимальное количество контейнеров можно перевезти за один рейс и какова масса самого тяжёлого контейнера среди всех контейнеров, которые можно перевезти за один рейс?    Входные данные. В первой строке входного файла находятся два числа: S   –   грузоподъёмность судна (натуральное число, не превышающее 100 000) и N   –   количество контейнеров (натуральное число, не превышающее 10 000). В следующих N строках находятся значения масс контейнеров, требующих транспортировки (все числа натуральные, не превышающие 100), каждое в отдельной строке.   Выходные данные. Два целых неотрицательных числа: максимальное количество контейнеров, которые можно перевезти за один рейс и масса наиболее тяжёлого из них. Пример входного файла: 100 4 80 30 50 40   При таких исходных данных можно транспортировать за один раз максимум 2 контейнера. Возможные массы этих двух контейнеров 30 и 40, 30 и 50 или 40 и 50. Поэтому ответ для приведённого примера:      2   50           Ответ:              \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/9255B88D1E5097D6438CCB75B1B75BE0(copy1)/xs3qstsrc9255B88D1E5097D6438CCB75B1B75BE0_2_1618913515.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 39
  },
  {
    "id": "C3D450",
    "type": "Впишите правильный ответ.",
    "text": "\n         Задание выполняется с использованием прилагаемых  к заданию файлов.       Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором есть два соседних места, таких что слева и справа от них в том же ряду места уже распределены (заняты). Гарантируется, что есть хотя бы один ряд, удовлетворяющий этому условию. В ответе запишите два целых числа: номер ряда и наименьший номер места из найденных в этом ряду подходящих пар свободных мест.   Входные данные В первой строке входного файла находится число N   –   количество занятых мест (натуральное число, не превышающее 10 000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 100 000: номер ряда и номер занятого места.   Выходные данные Два целых неотрицательных числа: номер ряда и наименьший номер места в выбранной паре. Пример входного файла: 7 40 3 40 6 60 33 50 125 50 128 50 64 50 67   Условию задачи удовлетворяют три пары чисел: 40 и 4, 50 и 126, 50 и 65. Ответ для приведённого примера:      50   65             \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/FB5B24C442358261436E7361777B82BB(copy1)/xs3qstsrcFB5B24C442358261436E7361777B82BB_2_1617273005.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 39
  },
  {
    "id": "38235A",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 6 единиц меньше длины стороны другой коробки. Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой коробки, где будет находиться подарок. Размер подарка позволяет поместить его в самую маленькую коробку. Входные данные В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, затем максимально возможную длину стороны самой маленькой коробки в таком наборе.  Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коробок и случая, когда минимальная допустимая разница между длинами сторон коробок, подходящих для упаковки «матрёшкой», составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коробок с длинами сторон 30, 40 и 43 или 32, 40  и 43 соответственно, т.е. количество коробок равно 3, а длина стороны самой маленькой коробки равна 32. Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/B3A241418DFDB5EE4FC6E1F50FCD2D22(copy2)/xs3qstsrcB3A241418DFDB5EE4FC6E1F50FCD2D22_3_1645778669.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 39
  },
  {
    "id": "FC12A4",
    "type": "Впишите правильный ответ.",
    "text": "\n         Задание выполняется с использованием прилагаемых  к заданию файлов.       Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором есть два соседних места, таких что слева и справа от них в том же ряду места уже распределены (заняты). Гарантируется, что есть хотя бы один ряд, удовлетворяющий этому условию. В ответе запишите два целых числа: номер ряда и наименьший номер места из найденных в этом ряду подходящих пар свободных мест.   Входные данные  В первой строке входного файла находится число N   –   количество занятых мест (натуральное число, не превышающее 10 000). Каждая из следующих N строк содержит два натуральных числа,  не превышающих 100 000: номер ряда и номер занятого места.   Выходные данные Два целых неотрицательных числа: номер ряда и наименьший номер места в выбранной паре. Пример входного файла: 7 40 3 40 6 60 33 50 125 50 128 50 64 50 67   Условию задачи удовлетворяют три пары чисел: 40 и 4, 50 и 126,  50 и 65. Ответ для приведённого примера:      50   65              \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/A90E3796DCD7B6424FB4D6AE6ADA4223(copy1)/xs3qstsrcA90E3796DCD7B6424FB4D6AE6ADA4223_2_1617272909.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 39
  },
  {
    "id": "7F1EAA",
    "type": "Впишите правильный ответ.",
    "text": "\n         Задание выполняется с использованием прилагаемых  к заданию файлов.       Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором есть два соседних места, таких что слева и справа от них в том же ряду места уже распределены (заняты). Гарантируется, что есть хотя бы один ряд, удовлетворяющий этому условию. В ответе запишите два целых числа: номер ряда и наименьший номер места из найденных в этом ряду подходящих пар свободных мест.   Входные данные В первой строке входного файла находится число N   –   количество занятых мест (натуральное число, не превышающее 10 000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 100 000: номер ряда и номер занятого места.   Выходные данные Два целых неотрицательных числа: номер ряда и наименьший номер места в выбранной паре. Пример входного файла: 7 40 3 40 6 60 33 50 125 50 128 50 64 50 67   Условию задачи удовлетворяют три пары чисел: 40 и 4, 50 и 126, 50 и 65. Ответ для приведённого примера:      50   65             \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/1EDD27CD554D91B3401B846653E9B31E(copy1)/xs3qstsrc1EDD27CD554D91B3401B846653E9B31E_2_1617272954.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 39
  },
  {
    "id": "BE60AB",
    "type": "Впишите правильный ответ.",
    "text": "\n         Задание выполняется с использованием прилагаемых  к заданию файлов.       Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором есть два соседних места, таких что слева и справа от них в том же ряду места уже распределены (заняты). Гарантируется, что есть хотя бы один ряд, удовлетворяющий этому условию. В ответе запишите два целых числа: номер ряда и наименьший номер места из найденных в этом ряду подходящих пар свободных мест.   Входные данные  В первой строке входного файла находится число N   –   количество занятых мест (натуральное число, не превышающее 10 000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 100 000: номер ряда и номер занятого места.   Выходные данные Два целых неотрицательных числа: номер ряда и наименьший номер места в выбранной паре. Пример входного файла: 7 40 3 40 6 60 33 50 125 50 128 50 64 50 67   Условию задачи удовлетворяют три пары чисел: 40 и 4, 50 и 126,  50 и 65. Ответ для приведённого примера:      50   65             \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/B41B4DFB257FB48E4EF6AB0D5E9CB3F8(copy1)/xs3qstsrcB41B4DFB257FB48E4EF6AB0D5E9CB3F8_2_1617273048.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 40
  },
  {
    "id": "8091A9",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых файлов.      В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та, в свою очередь, в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 9 единиц меньше длины стороны другой коробки. Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой из этих коробок. Размер подарка позволяет поместить его в самую маленькую коробку.   Входные данные В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, затем максимально возможную длину стороны самой маленькой коробки в таком наборе.    Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коробок и случая, когда минимальная допустимая разница между длинами сторон подходящих коробок составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коробок с длинами сторон 30, 40 и 43 или 32, 40 и 43 соответственно, т.е. количество коробок равно 3, а длина стороны самой маленькой коробки равна 32.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов. \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/1536A27C4CA4858B40D2800523A562AE(copy1)/xs3qstsrc9FBB259CD907A3E04F06EE7A1FFEE853_2_1747049285.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 40
  },
  {
    "id": "BD5ECE",
    "type": "Впишите правильный ответ.",
    "text": "\n         Задание выполняется с использованием прилагаемых  к заданию файлов.       Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором есть два соседних места, таких что слева и справа от них в том же ряду места уже распределены (заняты). Гарантируется, что есть хотя бы один ряд, удовлетворяющий этому условию. В ответе запишите два целых числа: номер ряда и наименьший номер места из найденных в этом ряду подходящих пар свободных мест.   Входные данные  В первой строке входного файла находится число N   –   количество занятых мест (натуральное число, не превышающее 10 000). Каждая из следующих N строк содержит два натуральных числа,  не превышающих 100 000: номер ряда и номер занятого места.   Выходные данные Два целых неотрицательных числа: номер ряда и наименьший номер места в выбранной паре. Пример входного файла: 7 40 3 40 6 60 33 50 125 50 128 50 64 50 67   Условию задачи удовлетворяют три пары чисел: 40 и 4, 50 и 126,  50 и 65. Ответ для приведённого примера:      50   65             \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/3BE3B2DD6DFA968140DCC2985DE338DE(copy1)/xs3qstsrc3BE3B2DD6DFA968140DCC2985DE338DE_2_1617273196.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 40
  },
  {
    "id": "A9339F",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       Входной файл содержит сведения о заявках на проведение мероприятий в конференц-зале. В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток). Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них. Если время окончания одного мероприятия совпадает со временем начала другого, то провести можно оба. Определите, какое максимальное количество мероприятий можно провести в конференц-зале, и каков при этом максимально возможный перерыв между двумя последними мероприятиями. Входные данные В первой строке входного файла находится натуральное число N (N ≤ 1000) – количество заявок на проведение мероприятий. Следующие N строк содержат пары чисел, обозначающих время начала и время окончания мероприятий. Каждое из чисел натуральное, не превосходящее 1440. Запишите в ответе два числа: максимальное количество мероприятий и самый длинный перерыв между двумя последними мероприятиями (в минутах).   Типовой пример организации данных во входном файле 5 10 150 100 120 131 170 150 180 120 130 При таких исходных данных можно провести максимум три мероприятия, например, мероприятия по заявкам 2, 3 и 5. Максимальный перерыв между двумя последними мероприятиями составит 20 мин., если состоятся мероприятия по заявкам 2, 4 и 5.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/CE35FC4BDCECA6B841344AD3BF5250F7(copy1)/xs3qstsrcCE35FC4BDCECA6B841344AD3BF5250F7_5_1678707540.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 40
  },
  {
    "id": "4522EF",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.     При онлайн-покупке билета на концерт известно, какие места в зале уже заняты. Необходимо купить билет на такое место в ряду, чтобы перед ним как можно больше идущих подряд кресел с таким же номером было свободно. Если места, удовлетворяющие этому условию, есть в нескольких рядах, то нужно выбрать ряд, расположенный как можно ближе к сцене. В ответе запишите два целых числа: искомый номер ряда и количество свободных кресел перед выбранным местом. Нумерация рядов и мест ведётся с 1. Гарантируется, что хотя бы одно такое место в зале есть.   Входные данные  В первой строке входного файла находятся три числа: N – количество занятых мест в зале (целое положительное число, не превышающее 10 000), M – количество рядов (целое положительное число, не превышающее 100 000) и K – количество мест в каждом ряду (целое положительное число, не превышающее 100 000). В следующих N строках находятся пары натуральных чисел: номер ряда и номер места занятого кресла соответственно (первое число не превышает значения M, а второе – K). Выходные данные  Два целых положительных числа: искомый номер ряда и количество свободных кресел перед выбранным местом.   Типовой пример организации данных во входном файле 9 6 7 1 1 2 4 3 6 6 1 4 3 5 5 5 2 6 6 4 7 При таких исходных данных условию задачи удовлетворяют места (ряд, место): 5, 1; 4, 2; 6, 4; 4, 5. Перед этими местами три подряд кресла свободны. Ответом является пара чисел 4 и 3.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемого файла.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/DA7F4A5F7358A4714A6ED7C6007D30CC(copy1)/xs3qstsrcC01686B873D3B77E4D55EA20BFD9C664_6_1721744197.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 40
  },
  {
    "id": "9A0AE4",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.     При онлайн-покупке билета на концерт известно, какие места в зале уже заняты. Необходимо купить билет на такое место в ряду, чтобы перед ним как можно больше идущих подряд кресел с таким же номером было свободно. Если места, удовлетворяющие этому условию, есть в нескольких рядах, то нужно выбрать ряд, расположенный как можно ближе к сцене. Если в этом ряду таких мест несколько, найдите кресло с наименьшим номером. В ответе запишите два целых числа: искомый номер ряда и наименьший номер места. Нумерация рядов и мест ведётся с 1. Гарантируется, что хотя бы одно такое кресло в зале есть.   Входные данные  В первой строке входного файла находятся три числа: N – количество занятых мест в зале (целое положительное число, не превышающее 10 000), M – количество рядов (целое положительное число, не превышающее 100 000) и K – количество мест в каждом ряду (целое положительное число, не превышающее 100 000). В следующих N строках находятся пары натуральных чисел: номер ряда и номер места занятого кресла соответственно (первое число не превышает значения M, а второе – K). Выходные данные  Два целых положительных числа: наименьший номер ряда и наименьший номер места.   Типовой пример организации данных во входном файле 9 6 7 1 1 2 4 3 6 6 1 4 3 5 5 5 2 6 6 4 7 При таких исходных данных условию задачи удовлетворяют места (ряд, место): 5, 1; 4, 2; 6, 4; 4, 5. Перед этими местами три подряд кресла свободны. Ответом является пара чисел 4 и 2.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемого файла.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/0E8A3BD21BDB9E9D4946A59B5A87682A(copy1)/xs3qstsrcCB0299F5B757B028449CF144E1CB3B8D_6_1721383532.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 40
  },
  {
    "id": "B3C563",
    "type": "Впишите правильный ответ.",
    "text": "\n \n\n\n\n\n\n\nЗадание выполняется с использованием прилагаемых  файлов.\n\n\n\n\n \nВходной файл содержит заявки пассажиров, желающих сдать свой багаж в камеру хранения. В заявке указаны время сдачи багажа и время освобождения ячейки (в минутах от начала суток). Багаж одного пассажира размещается в одной свободной ячейке с минимальным номером. Ячейки пронумерованы начиная с единицы. Размещение багажа в ячейке или её освобождение происходит в течение 1 мин. Багаж можно поместить в только что освобождённую ячейку начиная со следующей минуты. Если в момент сдачи багажа свободных ячеек нет, то пассажир уходит. Определите, сколько пассажиров сможет сдать свой багаж в течение 24 ч и какой номер будет иметь ячейка, которую займут последней. Если таких ячеек несколько, укажите минимальный номер ячейки.\nВходные данные\nВ первой строке входного файла находится натуральное число K, не превышающее 1000, – количество ячеек в камере хранения. Во второй строке – натуральное число N (N ≤ 1000), обозначающее количество пассажиров. Каждая из следующих N строк содержит два натуральных числа, каждое из которых не превышает 1440: указанное в заявке время размещения багажа в ячейке и время освобождения ячейки (в минутах от начала суток).\nЗапишите в ответе два числа: количество пассажиров, которые смогут воспользоваться камерой хранения, и номер последней занятой ячейки.\nТиповой пример организации данных во входном файле\n2\n5\n30 60\n40 1000\n59 60\n61 1000\n1010 1440\nПри таких исходных данных положить вещи в камеру хранения смогут первый, второй, четвёртый и пятый пассажиры. Последний пассажир положит вещи в ячейку 1, так как ячейки 1 и 2 будут свободны.\nТиповой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.\n\n\n\n\n \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/C94B5E8470D7B5FA4E9FA8FD1EF55F77(copy1)/xs3qstsrcC94B5E8470D7B5FA4E9FA8FD1EF55F77_4_1676287729.png','",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "584C6A",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 10 единиц меньше длины стороны другой коробки. Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой коробки, где будет находиться подарок. Размер подарка позволяет поместить его в самую маленькую коробку. Входные данные В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, затем максимально возможную длину стороны самой маленькой коробки в таком наборе.  Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коробок и случая, когда минимальная допустимая разница между длинами сторон коробок, подходящих для упаковки «матрёшкой», составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коробок с длинами сторон 30, 40 и 43 или 32, 40  и 43 соответственно, т.е. количество коробок равно 3, а длина стороны самой маленькой коробки равна 32. Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/AA0CABBF766DB6C94C4A040441D6EE88(copy2)/xs3qstsrcAA0CABBF766DB6C94C4A040441D6EE88_3_1645796195.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "0C1433",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 7 единиц меньше длины стороны другой коробки. Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой коробки, где будет находиться подарок. Размер подарка позволяет поместить его в самую маленькую коробку. Входные данные В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, затем максимально возможную длину стороны самой маленькой коробки в таком наборе.  Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коробок и случая, когда минимальная допустимая разница между длинами сторон коробок, подходящих для упаковки «матрёшкой», составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коробок с длинами сторон 30, 40 и 43 или 32, 40  и 43 соответственно, т.е. количество коробок равно 3, а длина стороны самой маленькой коробки равна 32. Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/2F3273B356D6BEDC432FE7B492BB972C(copy2)/xs3qstsrc2F3273B356D6BEDC432FE7B492BB972C_3_1645793366.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "A99635",
    "type": "Впишите правильный ответ.",
    "text": "\n \n\n\n\n\n\n\nЗадание выполняется с использованием прилагаемых  файлов.\n\n\n\n\n \nВходной файл содержит заявки пассажиров, желающих сдать свой багаж в камеру хранения. В заявке указаны время сдачи багажа и время освобождения ячейки (в минутах от начала суток). Багаж одного пассажира размещается в одной свободной ячейке с минимальным номером. Ячейки пронумерованы начиная с единицы. Размещение багажа в ячейке или её освобождение происходит в течение 1 мин. Багаж можно поместить в только что освобождённую ячейку начиная со следующей минуты. Если в момент сдачи багажа свободных ячеек нет, то пассажир уходит. Определите, сколько пассажиров сможет сдать свой багаж в течение 24 ч и какой номер будет иметь ячейка, которую займут последней. Если таких ячеек несколько, укажите минимальный номер ячейки.\nВходные данные\nВ первой строке входного файла находится натуральное число K, не превышающее 1000, – количество ячеек в камере хранения. Во второй строке – натуральное число N (N ≤ 1000), обозначающее количество пассажиров. Каждая из следующих N строк содержит два натуральных числа, каждое из которых не превышает 1440: указанное в заявке время размещения багажа в ячейке и время освобождения ячейки (в минутах от начала суток).\nЗапишите в ответе два числа: количество пассажиров, которые смогут воспользоваться камерой хранения, и номер последней занятой ячейки.\nТиповой пример организации данных во входном файле\n2\n5\n30 60\n40 1000\n59 60\n61 1000\n1010 1440\nПри таких исходных данных положить вещи в камеру хранения смогут первый, второй, четвёртый и пятый пассажиры. Последний пассажир положит вещи в ячейку 1, так как ячейки 1 и 2 будут свободны.\nТиповой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.\n\n\n\n\n \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/7E84828B803AA53146626878D3B2D1B7(copy1)/xs3qstsrc7E84828B803AA53146626878D3B2D1B7_4_1676289260.png','",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "E53C3B",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       Входной файл содержит сведения о заявках на проведение мероприятий в конференц-зале. В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток). Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них. Если время окончания одного мероприятия совпадает со временем начала другого, то провести можно оба. Определите, какое максимальное количество мероприятий можно провести в конференц-зале, и каков при этом максимально возможный перерыв между двумя последними мероприятиями. Входные данные В первой строке входного файла находится натуральное число N (N ≤ 1000) – количество заявок на проведение мероприятий. Следующие N строк содержат пары чисел, обозначающих время начала и время окончания мероприятий. Каждое из чисел натуральное, не превосходящее 1440. Запишите в ответе два числа: максимальное количество мероприятий и самый длинный перерыв между двумя последними мероприятиями (в минутах).   Типовой пример организации данных во входном файле 5 10 150 100 120 131 170 150 180 120 130 При таких исходных данных можно провести максимум три мероприятия, например, мероприятия по заявкам 2, 3 и 5. Максимальный перерыв между двумя последними мероприятиями составит 20 мин., если состоятся мероприятия по заявкам 2, 4 и 5.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/98AE3803B112AFFD44421521641C12AC(copy1)/xs3qstsrc98AE3803B112AFFD44421521641C12AC_5_1678707604.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "3B2A3F",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       Входной файл содержит сведения о заявках на проведение мероприятий в конференц-зале. В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток). Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них. Если время окончания одного мероприятия совпадает со временем начала другого, то провести можно оба. Определите, какое максимальное количество мероприятий можно провести в конференц-зале, и каков при этом максимально возможный перерыв между двумя последними мероприятиями. Входные данные В первой строке входного файла находится натуральное число N (N ≤ 1000) – количество заявок на проведение мероприятий. Следующие N строк содержат пары чисел, обозначающих время начала и время окончания мероприятий. Каждое из чисел натуральное, не превосходящее 1440. Запишите в ответе два числа: максимальное количество мероприятий и самый длинный перерыв между двумя последними мероприятиями (в минутах).   Типовой пример организации данных во входном файле 5 10 150 100 120 131 170 150 180 120 130 При таких исходных данных можно провести максимум три мероприятия, например, мероприятия по заявкам 2, 3 и 5. Максимальный перерыв между двумя последними мероприятиями составит 20 мин., если состоятся мероприятия по заявкам 2, 4 и 5.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/12221F5B1610B21F4CEA2FF0180E4783(copy1)/xs3qstsrc12221F5B1610B21F4CEA2FF0180E4783_5_1678707591.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "4A2884",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.     При онлайн-покупке билета на концерт известно, какие места в зале уже заняты. Необходимо купить билет на такое место в ряду, чтобы перед ним как можно больше идущих подряд кресел с таким же номером было свободно. Если места, удовлетворяющие этому условию, есть в нескольких рядах, то нужно выбрать ряд, расположенный как можно ближе к сцене. В ответе запишите два целых числа: искомый номер ряда и количество свободных кресел перед выбранным местом. Нумерация рядов и мест ведётся с 1. Гарантируется, что хотя бы одно такое место в зале есть.   Входные данные  В первой строке входного файла находятся три числа: N – количество занятых мест в зале (целое положительное число, не превышающее 10 000), M – количество рядов (целое положительное число, не превышающее 100 000) и K – количество мест в каждом ряду (целое положительное число, не превышающее 100 000). В следующих N строках находятся пары натуральных чисел: номер ряда и номер места занятого кресла соответственно (первое число не превышает значения M, а второе – K). Выходные данные  Два целых положительных числа: искомый номер ряда и количество свободных кресел перед выбранным местом.   Типовой пример организации данных во входном файле 9 6 7 1 1 2 4 3 6 6 1 4 3 5 5 5 2 6 6 4 7 При таких исходных данных условию задачи удовлетворяют места (ряд, место): 5, 1; 4, 2; 6, 4; 4, 5. Перед этими местами три подряд кресла свободны. Ответом является пара чисел 4 и 3.   Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемого файла.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/89C11E018DFEA3844B445B239F096DA1(copy1)/xs3qstsrcF0069FA2840784FA4B11ED18C34B50B2_6_1721387570.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "70B483",
    "type": "Впишите правильный ответ.",
    "text": "\n         Задание выполняется с использованием прилагаемых  к заданию файлов.       На грузовом судне необходимо перевезти контейнеры, имеющие одинаковый габарит и разные массы. Общая масса всех контейнеров превышает грузоподъёмность судна. Количество грузовых мест на судне не меньше количества контейнеров, назначенных к перевозке. Какое максимальное количество контейнеров можно перевезти за один рейс и какова масса самого тяжёлого контейнера среди всех контейнеров, которые можно перевезти за один рейс?    Входные данные. В первой строке входного файла находятся два числа: S   –   грузоподъёмность судна (натуральное число, не превышающее 100 000) и N   –   количество контейнеров (натуральное число, не превышающее 10 000). В следующих N строках находятся значения масс контейнеров, требующих транспортировки (все числа натуральные, не превышающие 100), каждое в отдельной строке.   Выходные данные. Два целых неотрицательных числа: максимальное количество контейнеров, которые можно перевезти за один рейс и масса наиболее тяжёлого из них. Пример входного файла: 100 4 80 30 50 40   При таких исходных данных можно транспортировать за один раз максимум 2 контейнера. Возможные массы этих двух контейнеров 30 и 40, 30 и 50 или 40 и 50. Поэтому ответ для приведённого примера:      2   50             \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/2E75146CF9E8B4AC4822D63904FB694B(copy1)/xs3qstsrc2E75146CF9E8B4AC4822D63904FB694B_2_1617273630.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "553F80",
    "type": "Впишите правильный ответ.",
    "text": "\n       Задание выполняется с использованием прилагаемых  файлов.       В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 3 единицы меньше длины стороны другой коробки. Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой коробки, где будет находиться подарок. Размер подарка позволяет поместить его в самую маленькую коробку. Входные данные В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке. Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, затем максимально возможную длину стороны самой маленькой коробки в таком наборе.  Типовой пример организации данных во входном файле 5  43 40 32 40 30 Пример входного файла приведён для пяти коробок и случая, когда минимальная допустимая разница между длинами сторон коробок, подходящих для упаковки «матрёшкой», составляет 3 единицы. При таких исходных данных условию задачи удовлетворяют наборы коробок с длинами сторон 30, 40 и 43 или 32, 40  и 43 соответственно, т.е. количество коробок равно 3, а длина стороны самой маленькой коробки равна 32. Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.      \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/B0EE7A089572AB8E46865CD5EDEB750A(copy2)/xs3qstsrcB0EE7A089572AB8E46865CD5EDEB750A_3_1645788415.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  },
  {
    "id": "97FA8B",
    "type": "Впишите правильный ответ.",
    "text": "\n         Задание выполняется с использованием прилагаемых  к заданию файлов.       Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, в котором есть два соседних места, таких что слева и справа от них в том же ряду места уже распределены (заняты). Гарантируется, что есть хотя бы один ряд, удовлетворяющий этому условию. В ответе запишите два целых числа: номер ряда и наименьший номер места из найденных в этом ряду подходящих пар свободных мест.   Входные данные  В первой строке входного файла находится число N   –   количество занятых мест (натуральное число, не превышающее 10 000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 100 000: номер ряда и номер занятого места.   Выходные данные Два целых неотрицательных числа: номер ряда и наименьший номер места в выбранной паре. Пример входного файла: 7 40 3 40 6 60 33 50 125 50 128 50 64 50 67   Условию задачи удовлетворяют три пары чисел: 40 и 4, 50 и 126,  50 и 65. Ответ для приведённого примера:      50   65             \n\n\n\n\n\n",
    "image": "https://ege.fipi.ru/docs/B9ACA5BBB2E19E434CD6BEC25284C67F/questions/737A2FAD4F838A564AF70C7D41DE3CDF(copy1)/xs3qstsrc737A2FAD4F838A564AF70C7D41DE3CDF_2_1617273100.png",
    "topic": "3.10 Массивы и последовательности чисел. Вычисление обобщённых характеристик элементов массива или числовой последовательности (суммы, произведения, среднего арифметического, минимального и максимального элементов, количества элементов, удовлетворяющих заданному условию). Линейный поиск заданного значения в массиве. Алгоритмы работы с элементами массива с однократным просмотром массива. Сортировка одномерного массива. Простые методы сортировки (метод пузырька, метод выбора, сортировка вставками). Сортировка слиянием. Быстрая сортировка массива (алгоритм QuickSort). Двоичный поиск в отсортированном массиве",
    "page": 41
  }
]