[
  {
    "id": "521F94",
    "type": "Задание №1. Впишите правильный ответ.",
    "text": "\n Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу один или четыре камня либо увеличить количество камней в куче в три раза. Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней. Игра завершается в тот момент, когда количество камней в куче становится не менее 67. Победителем считается игрок, сделавший последний ход, т.е. первым получивший кучу, состоящую из 67 или более камней. В начальный момент в куче было S камней; 1 ≤ S ≤ 66. Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.  Укажите такое значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом. \n\n\n\n\n\n",
    "image": null,
    "topic": "2.15 Дискретные игры двух игроков с полной информацией. Построение дерева перебора вариантов, описание стратегии игры в табличной форме. Выигрышные и проигрышные позиции. Выигрышные стратегии",
    "page": 42
  },
  {
    "id": "67484B",
    "type": "Задание №2. Впишите правильный ответ.",
    "text": "\n     Для игры, описанной в задании 19, найдите два таких минимальных значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия: − Петя не может выиграть за один ход; − Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня. Найденные значения запишите в ответе в порядке возрастания. \n\n\n\n\n\n",
    "image": null,
    "topic": "2.15 Дискретные игры двух игроков с полной информацией. Построение дерева перебора вариантов, описание стратегии игры в табличной форме. Выигрышные и проигрышные позиции. Выигрышные стратегии",
    "page": 42
  },
  {
    "id": "687734",
    "type": "Задание №3. Впишите правильный ответ.",
    "text": "\n Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два условия:   –   у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;   –   у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом. Если найдено несколько значений S, в ответе запишите наименьшее из них. \n\n\n\n\n\n",
    "image": null,
    "topic": "2.15 Дискретные игры двух игроков с полной информацией. Построение дерева перебора вариантов, описание стратегии игры в табличной форме. Выигрышные и проигрышные позиции. Выигрышные стратегии",
    "page": 42
  }
]